{"artist": "Mac Miller", "album": "Balloonerism", "track_title": "Tambourine Dream", "lyrics": "Lyrics not found.", "language": "unknown"}
{"artist": "Mac Miller", "album": "Balloonerism", "track_title": "DJ's Chord Organ (feat. SZA)", "lyrics": "[Intro: Mac Miller & \nJosh Berg\n]\nWhat he said after the Grammys\nB-flat\nF\nB-flat\nF\nD\n(Ooh)\n[Chorus: SZA & Thundercat]\nWatch the world go 'round, and 'round, and 'round, and 'round\nWatch the world go 'round, and 'round, and 'round, and 'round\nWatch the world go 'round, and 'round, and 'round, and 'round\nWatch the world go 'round, and 'round, and 'round, and 'round\nWatch the world go 'round, and 'round, and 'round, and 'round\nWatch the world go 'round, and 'round, and 'round, and 'round\nWatch the world go 'round, and 'round, and 'round, and 'round\nWatch the world go 'round, and 'round, and 'round, and 'round\n[Verse: SZA]\nI love when you smell like your car\nSmell like you've been drivin' for days\nYou ain't even stop for gas, my nigga\nMr. Postman\nIs you drivin' to me?\nIs you drivin' cross-country?\nYou've been up for three days with one nap\nI know you miss the nighttime\nI know you miss your lifetime\nTell me the truth about it\nTell me the truth about it\nTell us the truth about it\nCocaine is ruthless\nI know the truth about it\nCocaine is ruthless"}
{"artist": "Mac Miller", "album": "Balloonerism", "track_title": "Do You Have A Destination?", "lyrics": "[Intro: Mac Miller]\nAlright, let's get started\nWoo (Yeah), you can feel it (Yuh)\nCan you feel it? Vibrations (Yeah)\n\n[Verse 1: Mac Miller]\nOkay, I went to sleep faded, then I woke up invisible (Wow)\nKeep the ingredients, but I got the kitchen full (Woah)\nMy thoughts is cynical, actions unpredictable\nSupermodel bitches hold auditions in my swimmin' pool (Woo)\nThis feelin' is feelin' pretty invincible (I know)\nPray this life reciprocal, and I'ma come back an eagle\nThirsty for evil, the wine chilled in hell (Right here)\nI gave my life to this shit, already killed myself (Woo)\n(No, no, no, no, no) We ain't the same, homie (No)\nThe world afraid to change, but it changed on me (Woah)\nAlways been the realest, keep the same homies (Uh-huh)\nSo all that bullshit fades slowly\n\n[Chorus: Mac Miller]\nIt's goin' (Goin'), goin' (Goin'), goin' (Goin'; Okay), goin' (Goin'; Ooh)\nGoin' (Goin'), goin' (Goin'), goin' (Goin'), goin' (Goin')\nWill you follow? (Ooh)\nWhere are you going? (Watch it go, woah-woah-woah, woah-woah-woah)\nWhere are you going? (Woah-woah-woah, woah-woah-woah)\nWhere are you going? (Woah-woah-woah, woah-woah-woah)\nWhere the fuck are you going? (Woah, woah)\nOkay (Woah-woah-woah, wow)\nGoin' (Goin', goin', woah-woah-woah, yeah, wow)\n\n\n[Verse 2: Mac Miller & Delusional Thomas]\nOkay, I went to sleep famous and I woke up invisible\nRich as fuck and miserable\nAt least I did Kimmel and Arsenio, my mom got it on video\nThat's the shit I live for, all this other shit is trivial (One, two, go)\nWi-wi-wi-will you bear witness to a miracle?\nI don't know, I'm not a kid no more, comin' for those residuals (That money)\nBe asleep in a couple minutes\nMy bitch have a nightmare, wake up, made me some cereal (Woo, woo, woo)\nShe knows I love my cereal (She know it)\nThe sun come up, look at her face, said, \"Oh my God, here we go\"\n(Don't blow it) Yeah\nAm I okay? Fuck no\nJust so nuts, so\nNeed to let the drugs go\nTryna find Heaven, I get high but never come close\nWe still wonder why we'll never learn to love\nIt's because all the air is filled with gun smoke\nA middle finger to the cyber gods\nFall back or I'ma fuck around and let this virus off (Get it?)\nIn the mud, fuck your brainwash, I'm signin' off (Dead)\nCan't kill a god with an upload\n\n[Chorus: Mac Miller]\nYeah, goin' (Goin'), goin' (Goin'), goin' (Goin'), goin' (Goin'; Ooh)\nGoin' (Goin'), goin' (Goin'; Where are you goin'?), goin' (Goin'), goin' (Goin')\nDo you have a destination? (Ooh, wow, watch it go)\nDo you have a destination?\nDo you have a destination? (Wow)\nDo you have a destination?\nDo you have a destination? (Wow)\nDo you have a destination? (Woah-woah-woah)\nDo you have a destination? (Wow)\nDo you have a destination? (Woah-woah-woah, wow)\n[Outro: Mac Miller]\nDo you have a destination?", "language": "en"}
{"artist": "Mac Miller", "album": "Balloonerism", "track_title": "5 Dollar Pony Rides", "lyrics": "[Verse 1]\nSaid, it ain't about money\nI could show you the world, girl\nWhat can you do for me?\nWe can take a vacation, go somewhere in the country\nTurn the radio on, hear my song sayin' (Woah, oh, oh)\nMy favorite song sayin' (Woah, oh, oh)\nShe don't know she slept through the future\nMissed it, it was yesterday\nSo we (We) right (Right) back where we started\nShe still tryna get away (Get away)\nGirl, you wastin' my time (Time)\nAnd I am wastin' your time\nBut that's okay (Woah, oh, oh)\nI said, it's okay (Woah, oh, oh, oh)\n\n[Chorus]\nLet me give you what you want (Need), ooh\nAnd maybe later, what you need (Need), yeah\nI remember, girl, you used to have fun (Need), yeah\nNow I ain't seen a smile in a while\nHeard you're feelin' pretty lonely (Need), yeah\nYour daddy shoulda got you that pony\nLet me give you what you want\n\n[Verse 2]\nKillin' yourself like this\nGoin' crazy, keepin' all of these secrets\nHow is that livin'? (Livin', livin')\nEvery time I reminisce, I keep thinkin' it was better then\nI remember when we made (Made) out (Out) underneath the rain clouds\nStay (Stay) out (Out) late, I wanna lay down\nBreak (Break) ground (Ground), then you tell me (Woah, oh, oh)\nWoah, oh, woah, oh (Woah, oh)\nWe could be okay, don't know for sure (She don't, she don't, she don't know)\nJust familiar numbers hammered to your door\nYou left home right away (Right away)\n'Cause your life is like night and day (Night and day)\nYou keep goin', goin', goin' back and forth\n\n\n[Chorus]\nLet me give you what you want (Need), ooh\nAnd maybe later, what you need (Need), yeah\nI remember, girl, you used to have fun (Need), yeah\nNow I ain't seen a smile in a while\nHeard you're feelin' pretty lonely (Need), yeah\nYour daddy shoulda got you that pony\nLet me give you what you want\n\n[Outro]\nCan I, can I, can I, can I, can I, can I, can I give you what you need?\nCan I, can I, can I, can I, can I give you what you want?\nCan I, can I, can I, can I, can I, can I, can I\nCan I give you what you need, what you need?\nWhat do you need, girl? Yeah\nSaid, can I give you what you want?\nWoah, woah, woah-woah-woah-woah-woah\nCan I give you what you need?\nWoah, woah, woah-woah-woah-woah-woah\nSaid, can I give you what you want?\nWoah, woah, woah-woah-woah-woah-woah\nCan I give you what you need, what you need?\nWhat do you need, girl?", "language": "en"}
{"artist": "Mac Miller", "album": "Balloonerism", "track_title": "Friendly Hallucinations", "lyrics": "[Verse 1: Mac Miller]\nCan you hear the whispers of an innocent, ignorant child? (Child)\nIn the ocean, get to swimmin' or drown (Drown)\nHow long has it been since you smiled? (Smiled)\nGirl, I love the way your body fit inside that gown (That gown)\nHer Mama was a lady bug, her Papa was an atheist\nWorkin' on a novel set in Cold War Romania ('Mania)\nChasin' love, idolizin' Joan of Arcadia\nPray the landscapers don't wake her up (Her up)\nI'm a slave to the bass line\nConversation topic got us tangled in the grape vine\nStill wide awake, I'm a stranger to the daytime\nVampire, higher than a hang glider\nLook around and all I see is gray skies (Gray skies)\nThere's help inside that medicine cabinet\nCame in for the answers, but she left with a habit\nThere's no one on the other end of that telephone ('Phone)\nLet's fall asleep to the metronome (The metronome), yeah\n\n[Chorus: Mac Miller, Mac Miller & SZA]\nShe's fallin' for her hallucinations (Hallucinations)\nBut what's love without imagination? Yeah\nBaby, don't let them tell you what's real and what's not (And what's not)\nThere's a paradise waiting on the other side of the dock, woah\nIt's only real if it's real to you (Does it feel?)\nIt's only real if it's real to you\nIt's only real if it's real to you (So, what's it feel like? Yeah)\n\n\n[Verse 2: Mac Miller]\nTell me, is it real if you can't hold it in your arms, but it can touch you?\nFeel its texture pressin' up against your chest, you say, \"I love you\" (You don't hear it back)\nFallin' victim to a world that's filled with satire, Mark Twain admired\nOpen Tom Sawyer, read a passage to the cab driver\nShe only in the back seat of a taxi 'cause her car is in the shop with a flat tire\nMom say she believe her, but she always been a bad liar\nHad a plan to burn her past, but it backfired\nHold on and be strong, kneel before your king\nThe land you put your knees on, it won't be long 'til your path finds ya\nAnd if love is just a fantasy\nThen what's the problem if you fall in love with fantasy?\nThey assume she's confused with delusions she's creatin'\nIn the waitin' room for psychiatric evaluation\nShe doesn't have the patience to be treated like a patient\nIt'll be okay if she just swallow this pill\n\n[Chorus: Mac Miller, Mac Miller & SZA]\nShe's fallin' for her hallucinations\nWhat's love without imagination? Yeah\nBaby, don't let them tell you what's real and what's not\nThere's a paradise waiting on the other side of the dock, woah\nIt's only real if it's real to you\nIt's only real if it's real to you\nIt's only real if it's real to you\n\n\n[Bridge: Mac Miller, Mac Miller & SZA, SZA]\nHavin' conversations with friendly hallucinations\nI'll be havin' conversations with friendly hallucinations\nThey don't need no explanation, there is beauty in creation, my Lord\nHavin' conversations with friendly hallucinations\nI'll be havin' conversations with friendly hallucinations\nThey don't need no explanation, there is beauty in creation, my Lord\nMy Lord\n\n[Chorus: Mac Miller, Mac Miller & SZA]\nShe's fallin' for her hallucinations\nWhat's love without imagination? Yeah\nBaby, don't let them tell you what's real and what's not\nThere's a paradise waiting on the other side of the dock, woah\nIt's only real if it's real to you\nIt's only real if it's real to you\nIt's only real if it's real to you", "language": "en"}
{"artist": "Mac Miller", "album": "Balloonerism", "track_title": "Mrs. Deborah Downer", "lyrics": "[Verse 1: Mac Miller]\nYeah, nothin' is impossible (Impossible)\nDo this shit together, we unstoppable (Unstoppable)\nRaised to be a leader, not a navigator (Navigator)\nWrote this down on scraps of paper\nAll roads lead to the same confusion (Same confusion)\nI mean, all roads lead to the same conclusions (Same conclusions)\nFound my body somewhere in the sewer (Sewer)\nMy girl defined the word \"prolific\" for me\nAnd I can't read her mind, she wrote a different story (A different story)\nOh well, redemption is a funny bitch (Funny bitch)\nThe devil always be right where the money is (The money is)\nSomebody gotta be watchin' you, but no one is (But no one is)\nIt's kinda crazy life could be this simple (Life could be this simple)\nNothing's coincidence\nMy best friend packed his things, threw 'em in the car\nI haven't seen him since (Seen him since)\nGuess I understand, he always got the chills\nWhen he saw a room full of rolled up hundred dollar bills (Hundred dollar bills), yeah\n\n[Refrain: Mac Miller]\nEven pills turn to powder, baby\nSaid, even pills turn to powder\nThe world wanna crush 'em down (Crush 'em down)\nEven pills turn to powder, baby\nCan you sit right next to me and crush 'em down? (Crush 'em down)\nIf pills can turn to powder\nThen this world could turn to ash\nEverything seems so slow\nBut my past, I thought that it would last longer\nI just thought that, thought that, thought that\nThis feelin', this feelin' would last longer, yeah\n\n\n[Bridge: Mac Miller]\nOoh, ooh, ooh\nOoh, ooh, ooh\n\n[Verse 2: Mac Miller]\nYeah\nYeah, somebody gave me a treasure map\nNowhere on that motherfucker say where the X is at\nAnd I don't wanna see the whole world through a telecast\nBeen waitin' my whole life, I finally thought I should tell you that, yeah\nStarted smokin' weed again, started tryna read again\nClean myself up, now would you be my friend?\nDo I need to know the beginning to see the end?\nWhat's the difference 'tween the truth and things that we pretend?\nI lie awake faded, watch the days go by\nAnd only at the lows do I chase that high\nFear God, stay humble\nOriginal sin, we all come from the same struggle\n\n[Outro: Mac Miller & Ashley All Day]\nWhat ya gonna do when the money comin' slow?\nWhat ya gonna do when the money comin' slow?\nWhat ya gonna do when the money comin' slow\nAnd you left out on your own?\nWhat ya gonna do when the money comin' slow?\nWhat ya gonna do when the money comin' slow?\nWhat ya gonna do when the money comin' slow\nAnd you left out in the cold? Woah\nCan I get four Norcos, two Oxys, two Roxys, three methadone\nCouple Percocets, some heroin, two Xanax bars and six-ounces of that lean?\nThank you\nDo when the money comin' slow?\nWhat ya gonna do when the money comin' slow? (Slow)\nWhat ya gonna do when the money comin' slow? (Slow)\nWhat ya gonna do when the money comin' slow?\nWhat ya gonna do when the money comin' slow? (Slow)\nWoah-oh, woah-oh\nWhat ya gonna do?", "language": "en"}
{"artist": "Mac Miller", "album": "Balloonerism", "track_title": "Stoned", "lyrics": "[Intro]\nYeah, yeah\nBreaks down the pain\nYeah\n\n[Verse 1]\nShe breaks down the pain, she rolls up the weed\nShe far from a saint, she's all that I need\nShe lost in her thoughts, so hardly she speaks\nHer mind's always dirty and her soul's never free (Woah-woah)\nShe never been a groupie (No way)\nShe just in love with the music\nShe watch depressin' movies (Always)\nSomethin' from the '30s or the '40s about a dependent house wife (Woah-woah)\nShe makes up her bed like she makes up her stories\nAwake through the night, then she high from the morning\nI wish she could feel me, she never felt nothin'\nKnock on her door, she let me come in (Woah)\n\n[Pre-Chorus]\nI wish she would learn to laugh\nIsolation, she lockin' the bathroom door\n\n[Chorus]\nBaby, let's get stoned\nPut on a record, can I play you one more song?\nWe can get stoned\nI swear to God, Heaven feels just like home\nLet's go home (Yeah)\n\n\n[Verse 2]\nAnd the water, it's shallow like the lies that she tells\nCan't run from your shadow, can't hide from yourself\nShe hates that she cries when she's all by herself\nAnd she's always all by herself (Woah-woah)\nShe hardly talks in conversation (No way)\nBut, but when she do, all her words get lost in translation (Always)\nNo, she can't move (Woah-woah-woah)\n'Cause she paralyzed from fear that she fantasize\nThe doctor tried to analyze\nThey cannot find anything that's wrong with her\nHer parents never got along with her\nI had to make this song for her (Woah-woah-woah)\n\n[Pre-Chorus]\nI wish she would learn to laugh\nIsolation, she lockin' the bathroom door\n\n[Chorus]\nBaby, let's get stoned\nPut on a record, can I play you one more song?\nWe can get stoned\nI swear to God, Heaven feels just like home\nLet's go home (Ooh)\nBaby, let's get stoned\nPut on a record, can I play you one more song?\nWe can get stoned\nI swear to God, Heaven feels just like home\nLet's go home (Ooh)\n\n\n[Pre-Chorus]\nI wish she would learn to laugh\nIsolation, she lockin' the bathroom door\n\n[Chorus]\nBaby, let's get stoned\nPut on a record, can I play you one more song? (Ooh)\nWe can get stoned\nI swear to God, Heaven feels just like home\nLet's go home (Ooh)", "language": "en"}
{"artist": "Mac Miller", "album": "Balloonerism", "track_title": "Shangri-La", "lyrics": "[Intro]\nDon't be afraid to put your two cents in\nMight not be able to afford anything, but\nI'm always up for a bargain\nThe dragons are flying south for the winter\nThey don't like cold weather either\n\n[Verse 1]\nOkay, I was drivin' up to Shangri-La to get my meditation on\nI was thinkin' Lamb of God, she was thinkin' Saint Laurent\nShe sell the pussy on Millionaire's Avenue\nPaper's not the problem, spendin' money always casual\nWhy do you whine like your last name was Rothschild?\nLife been a bitch ever since they let me out the doghouse\nNo mercy for the docile, flow is hostile but don't sleep\nThe codeine came back to get me high again\n\n[Pre-Chorus]\nJust how super is a supermodel? (Oh)\nJust how super is a supermodel? (Oh)\n\n[Chorus]\nIt's the house of the risin' sun, a village of unusual\nIf I'm dyin' young, promise you'll smile at my funeral\nYeah, it's just a rule to follow\nLive today 'cause you can lose tomorrow\n\n\n[Verse 2]\nYeah, I am getting ready to sign my life away (My life away)\nThe weather's nice today, what a perfect day to die (Day to die)\nShe'd kill herself, but she'd rather get married\nThere's coconut vodka, but she'd rather have cherry (Have cherry)\nI wish my drug dealer took the Amex (The Amex)\nCan't find my debit card\nI told her, \"Meet me by the Annex\" (The Annex)\nWe can get high by the reservoir (Reservoir)\nOh my goodness, girl, you a milkshake, extra large (Extra large)\nNo, you shouldn't, you said it'd never get this far (Get this far)\nDo you have an extra ticket to the seminar?\nShow me where all the old records are\nShe got a brand new dinette set, but she still don't know how to set the table\nI told her that this feelin' 'bout as good as it gets\nShit, that bitch so unstable\n\n[Pre-Chorus]\nAnd just how super is a supermodel?\nJust how super is a supermodel?\n\n[Chorus]\nIt's the house of the risin' sun, a village of unusual\nIf I'm dyin' young, promise you'll smile at my funeral\nYeah, it's just a rule to follow\nLive today 'cause you can lose tomorrow", "language": "en"}
{"artist": "Mac Miller", "album": "Balloonerism", "track_title": "Funny Papers", "lyrics": "[Intro]\nDid no one ever teach you how to dance?\nNobody ever taught you how to dance?\nWell—well, everyone knows how to dance\nThere's only so much time\n\n[Verse 1]\nYeah, somebody died today, I\nI saw his picture in the funny papers\nDidn't think anybody died on a Friday\nSome angry banker, some kind of money trader\nRecently divorced, was drunk drivin' down the highway\nAnd drove off the bridge to his wedding song\nBlew out the bass in his speakers, you can still hear the treble goin' (Treble goin')\nThe hospital was useless, and everything was quiet but the music\nRecently, I only meet peace when in deep sleep\nBeen the same dream, world safe, smile on her face\nWaitin' on the other side (The other side)\nI wonder if He'll take me to the other side (The other side), yeah\nWhat your eyes see, too naive for war, and that'll screw ya\nStill bet it all on the glory, hallelujah\nI heard the answer in the gibberish of an old drunk\nAll he said was he's in no rush\n\n[Chorus]\nIf I could just pay my rent by Tuesday\nI bet I'd be rich by April Fools' day\nThe moon's wide awake, with a smile on his face\nAs he smuggle constellations in his suitcase\nDon't you love silence? (Silence)\n\n\n[Post-Chorus]\nEverything quiet but the music (Music)\nEverything quiet but the music\nDo you love silence? (Ooh)\nEverything quiet but the music\n(Hoo-hoo, hoo-hoo, hoo-hoo-hoo, hoo)\n\n[Verse 2]\nSomebody gave birth to a baby boy\nI saw his picture in the funny papers\nEleven pounds, named after his uncle Gabriel\nHis mother cried with her lips against his soft face (Soft face)\nWhy'd she bring these bright eyes into this dark place?\nOh, sweet, sweet oblivion\nWay before the information gets settled in\nI swear to God I never wanna sin again\nBut I fear that trouble's on its way (Yeah)\nThe mind go with age, don't surrender\nMy mistake, I misplaced all of my remembers\nBaby, there's a little vacation in the dresser\nTake one for depression, and two for your temper\n\n[Chorus]\nIf I could just pay my rent by Tuesday\nI bet I'd be rich by April Fools' day\nThe moon's wide awake, with a smile on his face\nAs he smuggle constellations in his suitcase\nDon't you love silence?\n\n\n[Verse 3]\nOh shit, here come the icebreaker\nIt's danger when he's bringin' out the lightsaber\nThe words awesome but he's talkin' outta turn often\nI blew the fuck up, then became the world's problem\nBad hygiene, all about that gross life\nHate to see somebody fuckin' up their own life (Their own life)\nJust roll the dice, put a twenty on midnight\nHave a feelin' we gon' win tonight (Win tonight)\n'Cause when the snakes start slitherin', you spot the chameleons\nYou realize you surrounded by reptilians ('Tilians)\nShit, I ain't an innovator, just a motherfuckin' illustrator (Illustrator)\n\n[Outro]\nWhy does it matter\nAt all? Oh, woah, woah", "language": "en"}
{"artist": "Mac Miller", "album": "Balloonerism", "track_title": "Excelsior", "lyrics": "[Intro: Mac Miller]\nYeah, yah\nYeah, yeah, yeah, yeah\nYeah (Yeah), um\n\n[Verse: Mac Miller & Delusional Thomas]\nOn Fourth Street, the orphan children play on the jungle gym\nLittle Timmy broke his arm again on the monkey bars\nJohnny's dad got a nicer car than all the other kids\nHe becomes the alpha and picks on everybody else\nMax protects Claire from all the bullies\nClaire always wish she was as pretty as Julie\nThe boys always chase Julie around the sandbox\nClaire just waits ’til she gets picked up by her grandpa\nAll of this before the brainwash starts\nBefore they get polluted, start thinkin' like adults\nLife is fantasy and somersaults then\nBefore the world tear apart imagination\nBefore there were rules, before there were limits\nYour only enemies were (Br-Brussels sprouts and spinach)\nMe, I used to want to be a wizard, when did life get so serious?\nWhatever happened to apple juice and cartwheels?\nWhatever happened to apple juice and cartwheels?\n\n[Outro: Mac Miller]\nAbracadabra\nAbracadabra\nAbra-cadabra (Hahaha)\nAbracadabra!\nVadacadous!\nExcelsior!", "language": "en"}
{"artist": "Mac Miller", "album": "Balloonerism", "track_title": "Transformations (feat. Delusional Thomas)", "lyrics": "[Intro: Mac Miller]\nJust kidding\nEverything ready, man? Features, man\nThis is gonna be fuckin' crazy, bro\nThis one's gonna be great, bro\nWe're gonna go off crazy, bro\nThis feature's for the hip-hop world, like, so we gotta take this one seriously, bro\nIt's really just Alarm Clock's\nAlright, he told me he wanted, he need to do a feature on the low, so I gotta do it right\nAnd when you're dealin' with DJ Clockwork\nYou're dealin' with someone that, A. knows his hip-hop\nHe knows his hip-hop, he, you know, he's a student of the game\nAnd, and, and he treats his bars like a, you know, he really does that shit\nUm\nI'm straight\nHere, at least have a, a beverage\nOh, there's a beer up there, there's a beer in the fridge, there's a, uh\nGrab the Tecate and then the Pacifico\n'Cause one's a bottle, and one's a can\nI don't know how, how much I'm tryna go in\nThank you, bro\n[Interlude: Delusional Thomas]\nYeah, um, alright\nOkay, so"}
{"artist": "Mac Miller", "album": "Balloonerism", "track_title": "Manakins", "lyrics": "[Intro: Mac Miller]\nYeah\n\n[Verse 1: Mac Miller]\nWell, my good days are exactly like the bad ones\nMy bitch say that I defy the laws of attraction\nI've always been terrified of endin' up normal (Normal)\nThings that we all search for end up findin' us\nGod is like the school bell, He gon' tell you when your time is up\nShit just end up workin' out, why do we wonder why it does? (Why it does)\nYeah, so I asked God to take me on a perfect day\nSwear I saw Him cryin', don't know why everyone sure it's rain\nEducation system, but I feel we only learn from change\nEvery time I think about it, shit just starts to hurt my brain\nProblems we can't solve always seem to be my favorite ones\nLife just gets so boring, playing superhero makes it fun (Fun)\nBut why is \"heroism\" so close to \"heroin\"? (Heroin)\n\n[Chorus: Dylan Reynolds & Mac Miller]\nWe are what we believe in\nThere is no such thing as freedom\nBut what can we do?\nWhat can we do?\n'Cause I see the light at the end of the tunnel (Yeah)\nIt feels like I'm dyin', dyin' (Yeah), dyin'\nI'm dead\n\n\n[Verse 2: Mac Miller]\nThey tell you that you need to sleep, and suddenly you do\nScared you gonna wake up as someone who isn't you\nWe've all been down that road before, poured alcohol on open sores\nNobody can hurt me if I go inside and close the door\nNot scared of growin' old and dyin', feel this where the answer lives\nYou wear the garments, everybody needs to dress some manikins (Manikins)\n\n[Chorus: Dylan Reynolds]\nWe are what we believe in\nThere is no such thing as dreamin'\nBut what can we do?\nWhat can we do?\n'Cause I see the light at the end of the tunnel\nIt feels like I'm dyin', dyin', dyin'\nI'm dead\n\n[Outro]\nMake some noise", "language": "en"}
{"artist": "Mac Miller", "album": "Balloonerism", "track_title": "Rick's Piano", "lyrics": "[Rick… Read More [Intro: Mac Miller & Josh Berg]\nUh, Josh (Yes?)\nKnock, knock (Who's there?)\nRick Rubin (Rick Rubin who?)\nRick Rubin's piano (Ayy), alright (Yes)\nEnough fuckin' around (Okay)\nYeah\nYeah (Yeah, yeah), wake up (Wake up)\nOpen up your eyes, I told you wake up (Wake up)\nAll of y'all are still bitches, but\nA smile just in place of your make up (Your make up)\nThe best is yet to come (Yeah)\n(What?) Yeah (What?)\n\n[Verse 1: Mac Miller]\nE.T.'s not dead, he's just a little bit faded\nPlease don't give me any credit, that's how people get jaded\nPlease don't nod your hеad, and please don't tell mе I made it\n'Cause people start to get worse once they think they the greatest (The greatest; Be patient)\n\n[Refrain: Mac Miller, Mac Miller & Dylan Reynolds]\nThe best is yet to come (The best is yet to come), yeah (Yeah)\n\n[Verse 2: Mac Miller]\nI told her, \"It get better soon\"\nI probably shoulda told her when she was in a better mood\nShe lookin' at me like, \"Anyone, except for you\"\nI had to go to California, she wished that I never moved\n\n\n[Refrain: Mac Miller, Mac Miller & Dylan Reynolds]\nSaid, \"Baby, the best is yet to come\", yeah (The best is yet to come)\n\n[Verse 3: Mac Miller]\nI wonder if the blind mice even wanna see\nI wonder if a deaf father ever hear his daughter scream (Scream)\nIs there a heaven? Can you see the god in me? I don't know, probably\nBut for now we'll keep waitin' (Waitin')\n\n[Refrain: Mac Miller, Delusional Thomas, Mac Miller & Dylan Reynolds]\n'Cause the best is yet to come, yeah (The best is yet to come)\n\n[Verse 4: Mac Miller]\nAnd, I wonder if the truth come with a song\nAnd if it do, will we ever get to sing along?\nSpend her paycheck on that lingerie, she scared to put it on\nShe never let her boyfriend see her in a thong, but\n\n[Refrain: Mac Miller, Mac Miller & Dylan Reynolds]\nThe best is yet to come (The best is yet to come)\n\n[Verse 5: Mac Miller]\nI shot myself on my birthday, fell into the ocean\nListened to their voices, I was lost in the commotion\nNone of us are chosen, I forgive 'em for their ignorance, but\nWhat's a man gotta do for a little bliss? (Fuck the future)\n\n\n[Refrain: Mac Miller, Mac Miller & Dylan Reynolds]\nThe best is yet to come (The best is yet to come)\n\n[Chorus: Mac Miller]\nWhat does death feel like?\nWhat does, what does death feel like? Oh, oh my God\nWhat does death feel like?\nI wonder, what does death feel like? Oh my, my God\nWhat does death feel like?\nWhat does, what does death feel like? (Oh) Yeah\nWhy does death steal life?\nWhy does, why does death steal life? Oh, oh my God\nWhy does death steal life?\nWhy does, why does death steal life? Oh my, my God\nWhy does death steal light?\nWhy does, why does death steal light? Oh my God\n\n[Outro: Mac Miller]\nOh my God, oh my God, oh my God\nOh my God, oh my God, oh, oh, my, my\nOh my God, oh my God, oh my God\nOh, oh, oh, yeah, yeah, yeah\nOh my God, oh my God, oh my God\nMy, my, my, my, my", "language": "en"}
{"artist": "Mac Miller", "album": "Balloonerism", "track_title": "Tomorrow Will Never Know", "lyrics": "[Verse 1]\nDo you fear that you'll have no control? (Your call has been forwarded to an automated—)\nYou walk through this world with your head above water\nShoes made of copper, just tryin' to float\nThe lake's frozen over, look down at yourself\nWhat's starin' back doesn't please you\nThe man don't believe you, he sees through the lies that you tell\nCards in your hand, you're lookin' at nothin'\nYou wonder when God will just listen and give you a break\nAnd He says, \"See, living and dying are one and the same\"\n\n[Chorus]\nDo they dream just like we do?\nDo they dream just like we do?\nDo they love just like we do? (Oh)\nDo they love just like we do? (Oh-oh-oh, oh-oh-oh)\nDo they feel just like we do? (Oh)\nDo they feel just like we do? (Oh-oh-oh-oh, oh-oh-oh-oh, oh-oh-oh-oh)\n\n[Verse 2]\nDo you know anything at all?\nYou've been waiting for answers\nThese parades and dancers keep building your castles from straw\nThe moon made of water, you swim to the shore\nYou can try your best escaping, the universe is breaking\nYou say you can't take it no more\nThe pressure is building like buildings you jumped from\nWishing that wishing could lift this conundrum\nThe streets that you walk on are shallow\nBut do you feel as big as your shadow?\n\n\n[Bridge]\nNo-oh-oh-oh-oh-oh-oh-oh-oh\nNo-oh-oh, oh-oh\nNo-oh-oh-oh-oh-oh-oh-oh-oh-oh-oh\nNo, no, no, no-oh\n\n[Chorus]\nDo they dream just like we do?\nDo they dream just like we do?\nDo they love just like we do?\nDo they love just like we do?\nDo they feel just like we do?\nDo they feel just like we do?\n\n[Outro]\nSaid, if you could make, if you could make\nIf you could make, if you could make, if you could make\nIf you could make, if you could make, if you could make\nIt go away\nGive you a chance to start all over\n[Instrumental]", "language": "en"}
