{"artist": "Mac Miller", "album": "Swimming", "track_title": "Come Back to Earth", "lyrics": "[Chorus]\nMy regrets look just like texts I shouldn't send\nAnd I got neighbors, they're more like strangers\nWe could be friends\nI just need a way out\nOf my head\nI'll do anything for a way out\nOf my head\n\n[Verse]\nIn my own way, this feel like livin'\nSome alternate reality\nAnd I was drownin', but now I'm swimmin'\nThrough stressful waters to relief\nYeah, oh, the things I'd do\nTo spend a little time in Hell\nAnd what I won't tell you\nI'll prolly never even tell myself\nDon't you know that sunshine don't feel right\nWhen you inside all day?\nI wish it was nice out, but it look like rain\nGrey skies are driftin', not livin' forever\nThey told me it only gets better\n\n[Chorus]\nMy regrets look just like texts I shouldn't send\nAnd I got neighbors, they're more like strangers\nWe could be friends\nI just need a way out\nOf my head\nI'll do anything for a way out\nOf my head", "language": "en"}
{"artist": "Mac Miller", "album": "Swimming", "track_title": "Hurt Feelings", "lyrics": "[Intro]\nYeah\nWoah-woah-woah-woah-woah-woah-woah-woah (Yeah-yeah, yeah-yeah)\nYeah-yeah\nWoah-woah-woah-woah-woah-woah-woah-woah (Yeah-yeah)\nYeah-yeah-yeah-yeah\nWoah-woah-woah-woah-woah-woah-woah-woah (Yeah-yeah-yeah-yeah-yeah-yeah)\nWell, okay\n\n[Chorus]\nI'm always sayin' I won't change but\nI ain't the same (Same)\nEverything is different, I can't complain\nYou don't know what you missin', shame on you\n(Yeah, yeah, yeah) Shame on you (Yeah)\nEverything is strange (Strange), that's just a game (Game)\nEverybody trippin' (Woo), throwin' it away (Yeah)\nWe was gettin' lifted, now we gettin' paid\nShame on you (Yeah)\n\n[Verse 1]\n(I-I) Yeah (I)\nI paid the cost to see apostrophes, that means it's mine (Yeah)\nKeep to myself, takin' my time (Uh-huh)\nAlways into some bullshit, and outta line\nDrivin' with my eyes closed, missin' all the signs\nTurn the ignition, I'm driven and sittin' pretty (Pretty)\nListenin' to Whitney and whippin' it through the city, yeah (Yeah, yeah)\nMan on a mission, figure it out\nPuttin' way too much on my shoulders, please hold me down (Down, down)\nI keep my head above the water (Water)\nMy eyes gettin' bigger, so the world is gettin' smaller (Smaller)\nI be gettin' richer but that only made me crazy\nMama told me I was different even when I was a baby\nThat Mercedes through the P.A. when I pull up (Pull up)\nSoundin' like a concert, or a (Or a)\nOr a monster truck, I'm trippin' but I'm fallin' up\nAlways said I want it all, but it's not enough\nWell, o-kay (Yeah)\n\n\n[Chorus]\nI'm always sayin' I won't change but\nI ain't the same (Same)\nEverything is different, I can't complain\nYou don't know what you missin', shame on you\n(Yeah, yeah, yeah) Shame on you (Yeah)\nAnd everything is strange (Strange), that's just a game (Game)\nEverybody trippin' (Woo), throwin' it away (Yeah)\nWe was gettin' lifted, now we gettin' paid\nShame on you (Yeah)\n\n[Bridge]\nWe've only just begun\nNo, we don't wanna hurt your feelings\n'Cause it's only just begun\nNo, we don't wanna\nHurt (Hurt) feelings (Feelings)\n\n[Verse 2]\nDown go the system, long live the king (King)\nTurn the power off and get your water from the spring (Spring)\nI'm bringin' everyone with me when shit get iffy (Yeah)\nI give a hundred and fifty percent\nThis is the shit that I'm dealin' with, but I wish I'd forget\nUsed to be feelin' depressed, now that I'm livin' I'm a little obsessed, yes\nHigh in Jacuzzis, I be hittin' the jets\nI'm showin' her some love, she been givin' me sex (Bless, bless)\nRespect to Adonai\nDon't fuck around and be a victim of your pride, why you lyin'?\n(Why you lyin'?) Tell the truth, just step aside\nI don't got the time to let it slide (Yep)\nI'm too grounded, push whips that move mountains\nNew cribs, blue fountains, these are my surroundings\nI be goin' through it, you just go around it\nBut it's really not that different when you think about it\n\n\n[Chorus]\nI'm always sayin' I won't change but\nI ain't the same (Same)\nEverything is different, I can't complain\nYou don't know what you missin', shame on you\n(Yeah, yeah, yeah) Shame on you (Yeah)\nAnd everything is strange (Strange), that's just a game (Game)\nEverybody trippin' (Woo), throwin' it away (Yeah)\nWe was gettin' lifted, now we gettin' paid\nShame on you (Yeah)\n\n[Outro]\nHurt\nFeelings", "language": "en"}
{"artist": "Mac Miller", "album": "Swimming", "track_title": "What's the Use?", "lyrics": "[Intro: Mac Miller]\nYeah\n\n[Chorus: Mac Miller]\nYou can love it, you can leave it\nThey say you're nothin' without it\nDon't let them keep you down\nWhat if I don't need it?\nThere's somethin' about it\nThat just freaks me out\nI just want another minute wit' it, fuck a little\nWhat's the use?\nNever superficial, you gon' know it when it hit you\nGet a little sentimental when I'm off the juice\n\n[Verse 1: Mac Miller]\nYeah\nOkay, we're colder than the breeze\nBut the breeze ain't flowin' like me, motherfucker, hol' up\nYou don't need to hol' up, yeah\nAnd I can show you how I seem\nWhat it is, what it truly might be, nothin' that you know of\nYou don't need to hol' up\nI'm so a-bove and beyond\nYou take drugs to make it up way up where we on\nSpace shuttle, Elon\nTime, we don't waste much, fuck when we wake up\nThen I have her sing just like Céline Dion\nCatch me if you can but, you'll never catch me, damn\nWhole lotta, \"Yes, I am\"\nAll the way in wit' no exit plan\nAlready left and the jet don't land\nYeah, the time is tickin', come take a ride, get inside\nThis is highly different, I'm talkin' fly, got a pilot wit' 'im, uh\nCan I mind my business?\nWhy you trippin'? Give you somethin' that your eyes can witness\nOoh, you're too close\nI don't understand why you doin' the most\n\n\n[Chorus: Mac Miller, Snoop Dogg, Both]\nYou can love it, you can leave it\nThey say you're nothin' without it\nDon't let them keep you down\nWhat if I don't need it?\nThere's somethin' about it\nThat just freaks me out\nI just (I just) want a (Want a) 'nother ('Nother) minute (Minute) wit' it\nFuck a little, what's the use?\nWhat's the use? (Use)\nNever (Never) super- (Super) -ficial (Ficial)\nYou gon' (You gon') know it (Know it) when it (When it) hit you (Hit you)\nGet a (Get a) little (Little) senti- (Senti) -mental when I'm off the juice (Turn it up)\n\n[Verse 2: Mac Miller]\nWell, I'ma give you what you came for, yeah\nShit, I've worked too hard to have a clue who you are\nSet the bar so far above par, we can parlay all day\nCrib long range with the yard\nI know I should probably pray more but you gotta love me\n'Cause I save the day, spend money\nWhen I had nothin', shit, it wasn't so funny\nMade a promise to the homies nobody go hungry\nLook how far we came, still they throwin' dirt on my name\nBut it never worry my brain\nHeads turnin' like a hurricane swervin'\nTell the sun, \"Get up outta my shade\"\nIf they don't get the picture, cut 'em outta that frame, shit\nI'm up thirty thou' miles plus change\nIt's been a while but I'm down 'til I'm out\nAnd it is what it is 'til it ain't, yeah\n\n\n[Bridge: Thundercat]\nOoh-oh, up above the clouds\nOoh, I just wanna fly\nAh-ah-ah-ah-ha\n\n[Chorus: Mac Miller, Snoop Dogg, Both]\nYou can love it, you can leave it\nThey say you're nothin' without it\nDon't let them keep you down\nWhat if I don't need it?\nThere's somethin' about it\nThat just freaks me out\nI just (I just) want a (Want a) 'nother ('Nother) minute (Minute) wit' it\nFuck a little, what's the use?\nWhat's the use? (Use)\nNever (Never) super- (Super) -ficial (Ficial)\nYou gon' (You gon') know it (Know it) when it (When it) hit you (Hit you)\nGet a (Get a) little (Little) senti- (Senti) -mental when I'm off the juice (Juice)\n\n[Outro: Snoop Dogg]\nYou can love it\nIt just freaks me out", "language": "en"}
{"artist": "Mac Miller", "album": "Swimming", "track_title": "Perfecto", "lyrics": "[Intro]\nYeah, yeah, yeah, yeah, yeah\nYeah, yeah\nYeah, yeah, yeah, yeah\n\n[Chorus]\nWell, it ain't perfect but I don't mind\nBecause it's worth it\nWho really has the time at all?\nIt ain't perfect but I don't mind\n'Cause on the surface I look so fine\nBut really I'm buggin', buggin'\nMakin' somethin' outta nothin'\n\n[Verse 1]\nYeah, as hard as it gets: cool, calm and collected\nHoldin' my breath, this ain't what I expected\nDon't argue to death, pull my heart out my chest\nThe cards is all on the table, I'm callin' it\nDon't say it, I swallow it\nWhen livin' off of borrowed time\nOften I'm on the fence, on a line\nAddin' up what's on my mind\nMy feet on the clouds, head on the ground\nThat weed goin' down, bet you know me now\n\n\n[Pre-Chorus]\nI'm treadin' water, I swear\nThat if I drown, I don't care\nThey callin' for me from the shore, I need more\n\n[Chorus]\nWell, it ain't perfect but I don't mind\nBecause it's worth it\n(Is it? Is it? Is it? Is it? Is It?)\nWho really has the time at all?\n(Is it? Is it? Is it? Is it? Is It?)\nIt ain't perfect but I don't mind\n'Cause on the surface I look so fine\nBut really I'm buggin', buggin'\nMakin' somethin' outta nothin'\n\n[Verse 2]\nYeah, it feel like the weekend on a Tuesday, I can move dates\n\"I got somethin' else to do\" day, always do hate\nIf I do say, the D'USSÉ with the homies like it's Kool-Aid\nMe? I'm just tryna play it cool, J (Anyways)\nYeah, mind over matter, I'm purer than alkaline\nBeen stuck on album time, I gotta get out to shine\nFly on the wall, shit, I was buggin'\nMiss me like you gettin' withdrawal, I keep that comin', yeah\n\n\n[Pre-Chorus]\nI'm treadin' water, I know\nIf I stop movin', I'll float\nAin't nothin' new, it—\nJust play it cool, baby, just play it cool\nYou know, cool\n\n[Chorus]\nWell, it ain't perfect but I don't mind\nBecause it's worth it\nWho really has the time at all?\nIt ain't perfect but I don't mind\n'Cause on the surface I look so fine\nBut really I'm buggin', buggin'\nMakin' somethin' outta nothin'\n\n[Outro]\nYeah, tell me you love me, spin me around\nPretty please, pick me up in the air and don't put me down\nSeen it all unfold, sat back and watched\nKnowin' time don't give a fuck about clocks until they stop\nBare feet, runnin' late, her car started\nEven though the only thing that she drivin' a hard bargain\nMore important is I'm kinda sorta out the door, but\nShe put me back together when I'm outta order\nPerfect", "language": "en"}
{"artist": "Mac Miller", "album": "Swimming", "track_title": "Self Care", "lyrics": "[Part I: Self Care]\n\n[Intro: Mac Miller & JID]\n(Check, check, check, check, check, check) Mhm, mhm\n(Okay) Mhm (It don't work, it don't work)\n(It don't work, it don't work)\nYeah, yeah, yeah, yeah (It don't work, it don't work)\nYeah, yeah, yeah (It don't work, it don't work, dollars)\n\n[Chorus: Mac Miller]\nI switched the time zone, but what do I know?\nSpendin' nights hitchhikin', where will I go?\nI could fly home, with my eyes closed\nBut it'd get kinda hard to see, that's no surprise though\nAnd you could find me, I ain't hidin'\nI don't move my feet when I be glidin'\nI just slide in and then I roll out\n\n[Verse 1: Mac Miller & JID]\nYep, well, climbin' over that wall (Climbin' over that wall; Yeah, wall, wall)\nMm, I remember, yes, I remember, yes, I remember it all\nSwear the height be too tall (Yeah), so like September I fall\n(Down, down, down) Down below\nNow I know that the medicine be on call, yeah (Gimme, gimme, gimme)\nWhen it's feelin' like you hot enough to melt, yeah\nCan't trust no one, can't even trust yourself, yeah\nAnd I love you, I don't love nobody else, yeah (Ooh-woah)\n\n\n[Refrain: Mac Miller & JID]\nTell them they can take that bullshit elsewhere (Yeah)\nSelf care, I'm treatin' me right, yeah\nHell yeah, we gonna be alright (We gon' be alright)\n\n[Chorus: Mac Miller]\nI switched the time zone (Yeah), but what do I know?\nSpendin' nights hitchhikin', where will I go?\nI could fly home, with my eyes closed\nBut it'd get kinda hard to see, that's no surprise though\nAnd you could find me (Yeah), I ain't hidin'\nI don't move my feet when I be glidin'\nI just slide in (Yeah) and then I roll out\n\n[Interlude: Devonté Hynes]\nOut on the road, I don't see\nOut on the road, I don't see where I'm goin', ooh\n\n[Verse 2: Mac Miller & JID]\nYeah, I been readin' them signs (Readin' them signs; Wow, yeah, yeah, yeah)\nI been losin' my, I been losin' my, I been losin' my mind, yeah (Wow)\nGet the fuck out the way (Okay), must be this high to play (Okay)\nIt must be nice up above the lights\nAnd what a lovely life that I made, yeah (Uh)\nI know that feelin' like it's in my family tree, yeah (Woah)\nThat Mercedes drove me crazy, I've been speedin' (Skrrt, skrrt, skrrt, skrrt, skrrt)\nSomebody save me from myself, yeah (Ooh-woah)\n\n\n[Refrain: Mac Miller & JID]\nTell them they can take that bullshit elsewhere (Woah)\nSelf care, we gonna be good\nHell yeah, they lettin' me co-o-o-o-o-o-o-ok\n\n[Chorus: Mac Miller]\nI switched the time zone (Yeah), but what do I know? (Yeah)\nSpendin' nights hitchhikin', where will I go? (Yeah)\nI could fly home (Yeah), with my eyes closed\nBut it'd get kinda hard to see, that's no surprise though\nAnd you could find me (Yeah), I ain't hidin'\nI don't move my feet when I be glidin'\nI just slide in (Yeah) and then I roll out\n\n[Part II: Oblivion]\n\n[Intro: Mac Miller]\nI didn't know, I didn't know\nI didn't know, I didn't know, yeah\nWell, didn't know what I was missin', now I see a lil' different\nI was, thinkin' too much\n\n[Chorus: Mac Miller]\nGot stuck in oblivion, yeah, yeah\nOblivion, yeah, yeah\nOblivion, yeah, yeah\nI got all the time in the world, so for now I'm just chillin'\nPlus I know it's a, it's a beautiful feelin'\nIn oblivion, yeah, yeah\nOblivion, yeah, yeah\nOblivion, yeah, yeah\n\n\n[Verse: Mac Miller]\nYeah, okay, I ride around my city when I come home, yeah\nThe sun set quickly, then get up slow, yeah\nI just connect and upload\nWatch it spin around, we just spinnin' round, yeah\nLet's go and travel through the unknown, yeah\nWe play it cool, we know we fucked though, yeah\nYou keep on sayin' you're in love, so\nTell me, are you really down? Are you really down? Yeah\nLet's go back to my crib and play some 45s\nIt's safe in there, I know there's still a war outside\nWe spend our nights all liquored up, our mornings high\nCan you feel it now?\n\n[Chorus: Mac Miller]\nOblivion, yeah, yeah\nOblivion, yeah, yeah, yeah, yeah, yeah, yeah, yeah\nOblivion, yeah, yeah\nOoh-ooh, ooh-ooh\nI got all the time in the world, so for now I'm just chillin'\nPlus, I know it's a, it's a beautiful feelin'\nIn oblivion, yeah, yeah\nOblivion, yeah, yeah\nOblivion, yeah, yeah", "language": "en"}
{"artist": "Mac Miller", "album": "Swimming", "track_title": "Wings", "lyrics": "[Intro]\nYeah, well\n\n[Verse 1]\nI got a bone to pick like roses (Roses)\nI ain't feelin' broken no more\nBalled a fist, they gossipin', I notice\nTalkin' shit, I wander through the motives\nWonder who the fuck we're supposed to be\nI ain't worried now 'til I leave\nI'm just tryna ride and feel the breeze\nWith somethin' bad beside n' next to me\nWind in my face, don't stop now when it feels so great\nYou can run 'til you slip on the sidewalk\nAnd the same bone that you picked gon' break, that's a motif\n(That's a motif) Yeah\nWhen it's comin' right back, so familiar, never been realer\nNever felt so damn good where I'm at\nI don't know what it's all about\nRunnin' through too many thoughts to count (That's way better)\nStill ain't addin' up, I'll let you know when I've had enough, yeah\nYeah, well\n\n[Pre-Chorus]\nI'd put some money on forever, but I (Hey)\nDon't like to gamble on the weather, so I\nJust watch while\nThe sun is shinin', I can look at the horizon\nThe walls keep gettin' wider, I just hope I never find 'em, I know\nHey, well\n\n\n[Chorus]\nThese are my wings\nThese are my wings, yeah\nThese are my wings\n\n[Verse 2]\nYeah, well\nMovin' so fast, the clock look slow (Slow)\nWater my seeds 'til the flower just grow, yeah\nLove so much that my heart get broke\nI don't really know how the normal shit go, so\nI guess I just play it by ear, silence is all that I hear\nListenin' close as I can\nGrowin' up (One, two, three), jump\nNobody holdin' my hand, no\nTrust is a problem, never knew how, yeah\nThat's why I just keep to myself\nGet what I need, then I'll be out (Please tell me)\nWho can surf the universe with me?\nLucifer is human, so are we\nAll I ever want is what I need\nAnd that don't include your time and company\nFollow me, we on the up and up\nRemember when I owed a hundred bucks?\nNow, I look around like, \"What the fuck?\"\nIf you don't fuck with me, you fuckin' up\n\n\n[Pre-Chorus]\nI know I need to watch my temper, so I\nDon't ever gamble on the weather, but I\nJust watch while the\nThe sun is shinin', I can look at the horizon\nThe walls keep gettin' wider, I just hope I never find 'em, no, no\nYeah, well\n\n[Chorus]\nThese are my wings\nThese are my wings\nThese are my wings", "language": "en"}
{"artist": "Mac Miller", "album": "Swimming", "track_title": "Ladders", "lyrics": "[Chorus]\nSomehow we gotta find a way\nNo matter how many miles it take\nI know it feels so good right now\nBut it all come fallin' down\nWhen the night, meet the light, turn to day\nCan't stop, then you won't stop\nI know just how that feel\nWhen you're on top, 'til the ball drop\nYou've never seen it be so real\nIt feels so good right now\nBut it all come fallin' down\nWhen the night, meet the light, turn to day\n\n[Verse 1]\nFeel it a little, feel it a lot\nI'm swimmin' a bit, but deeper in thought\nKeepin' my head on top of my shoulders\nInto some shit, I'm out of the box\nThis the level I'm on, needin' it all right now or forever is gone\nBaby, the weather is strong, whether it's hot or cold\nI'm comin', knockin' on yo' door\nWell, I'ma, I'ma maintain how I'm stayin' so high\nPut the ladder all the way up 'til we touchin' the sky\nAnd you know you're dead wrong, you're in love with a lie\nAll I, all I, all I wanna do is free yo' mind\nWe don't see no lines, we don't color inside\nIt's a very small world, we don't fuck with the size, yeah\nSee the bigger picture when it's beneficial\nLovin' how I fit you, blow the whistle when you run out of time, yeah\nWakin' up, I open up my eyes\nDo you mind if I blow yo' mind?\nA little closer, baby, don't be shy\nWhy you worried that it's gon' be fine?\nI guess it's that kinda day\nIt's really all I'm tryna say\nWe don't have a lot of time to waste\nSomehow we gotta find a way\n\n\n[Chorus]\nSomehow we gotta find a way\nNo matter how many miles it takes\nI know it feels so good right now\nBut it all come fallin' down\nWhen the night, meet the light, turn to day\n\n[Post-Chorus]\nI wouldn't wait forever\nJust shoot yo' shot\nWe don't need no more, no extras\nWe all we got\n\n[Instrumental Bridge]\n\n[Verse 2]\nYeah, yeah\nAll the lights flickerin', hittin' the right switches\nI'm livin' this life different and missin' the flight bullshittin'\nI had a plan to change, you can't stand the rain\nLittle delayed, but I came and you cool wit' it\nI don't trip, flip or lose my grip\nAnd I don't know it all, but I do know this\nBefore you know me, better know self\nI've been in this shit so long that it don't smell\nI turn the hotel to a castle\nLivin' like a king for a grand\nI don't do nothin', that's a hassle\nBesides, even that castle made of sand\nJust might slip into the sea\nFuck it all, if it all ain't me\nMaybe we inside the maze\nSomehow we gotta find a way, okay\n\n\n[Chorus]\nSomehow we gotta find a way\nNo matter how many miles it takes\nI know it feels so good right now\nBut it all come fallin' down\nWhen the night, meet the light, turn to day\n\n[Post-Chorus]\nI wouldn't wait forever\nJust shoot yo' shot\nWe don't need no more, no extras\nWe all we got\n\n[Instrumental Outro]", "language": "en"}
{"artist": "Mac Miller", "album": "Swimming", "track_title": "Small Worlds", "lyrics": "[Intro]\nYeah, yeah\n\n[Chorus]\nThe world is so small 'til it ain't, yeah\nI'm buildin' up a wall 'til it break\nShe hate it when I call and it's late\nI don't wanna keep you waitin'\nI hope I never keep you waitin', yeah\n\n[Verse 1]\nI think I know it all but I don't\nWhy you always at the mall when you're broke? Yeah\nAnd I just wanna ball\nMaybe dunk, but I never been tall, yeah\nI might trip, I never fall\nGod knows I came close (Don't try this at home)\nI know I probably need to do better\nFuck whoever, keep my shit together\nYou never told me bein' rich was so lonely\nNobody know me, oh well\nHard to complain from this five-star hotel\nI'm always in a rush, I've been thinkin' too much, but\nKeep it on the hush, no one need to know, just us\n\n[Pre-Chorus]\nThat's really all it takes\nWe don't need nothin' but today (Day), today (Day), today (Day), today (Day)\n\n\n[Chorus]\nThe world is so small 'til it ain't ('Til it ain't, 'til it ain't, 'til it ain't)\nI'm buildin' up a wall 'til it break ('Til it break, 'til it break, 'til it break)\nShe hate it when I call and it's late (And it's late, and it's late)\nI don't wanna keep you waitin' (I don't wanna keep you waitin')\nI hope I never keep you waitin' (I hope I never keep you waitin')\n\n[Bridge]\nWoo (Yeah, yeah, yeah, yeah, yeah, yeah, yeah)\nWoo (Yeah, yeah, yeah, yeah, yeah, yeah, yeah)\nWoo (Yeah, yeah, yeah, yeah, yeah, yeah, yeah)\nWoo (Yeah, yeah, yeah, yeah, yeah, yeah)\nWoo (Yeah, yeah, yeah, yeah, yeah, yeah, yeah)\nWoo (Yeah, yeah, yeah, yeah, yeah, yeah, yeah)\nWoo (Yeah, yeah, yeah, yeah, yeah, yeah, yeah)\nWoo (Yeah, yeah, yeah, yeah)\n\n[Verse 2]\nYeah, got a bad attitude, playin' 'til I'm out of moves\nNo need for shame, I get mo' peace at slow speeds\nGo beat the game, young control freak\nIt's cold in my veins, I'm below freezin', snow season (Made me)\nThey know that I so need my space\nDon't wanna grow old so I smoke just in case\nShe say that I glow below the waist\nAnd the stroke is just so PGA\nAll I got is a little bit of space and time\nDrawin' shapes and lines of a world we made\nTomorrow may be right around the corner\nBut I swear it's gon' be worth it if I make you wait\nThere's somewhere above you, keep reachin' up\n\n\n[Pre-Chorus]\nThat's really all it takes (That's really all it takes)\nWe don't need nothin' but today (Day), today (Day), today (Day), today (Day)\n\n[Chorus]\nThe world is so small 'til it ain't ('Til it ain't, 'til it ain't, 'til it ain't)\nI'm buildin' up a wall 'til it break ('Til it break, 'til it break, 'til it break)\nShe hate it when I call and it's late (And it's late, and it's late)\nI don't wanna keep you waitin' (I don't wanna keep you waitin')\nI hope I never keep you waitin'\n[Verse 3]\nYeah, nine times out of ten, I get it wrong\nThat's why I wrote this song, tell myself to hold on\nI can feel my fingers slippin', in a motherfuckin' instant, I'll be gone\nDo you want it all if it's all mediocre?\nStarin' at the wall and the wall full of posters\nLookin' at my dreams, who I wanna be?\nI guess you gotta see it to believe\nOoh, I been a fool but it's cool, that's what human beings do\nKeep your eyes to the sky, never glued to your shoes\nGuess there was a time when my mind was consumed\nBut the sun comin' out now, clouds start to move\nDon't tell me nothin' but the truth\nI'm tired, I don't got a spare second\nWin or lose, win or lose\nI don't keep count, nobody checkin'", "language": "en"}
{"artist": "Mac Miller", "album": "Swimming", "track_title": "Conversation Pt. 1", "lyrics": "[Chorus]\nWe ain't on the same shit, no way\nYou ain't from my planet, we don't speak the same language\nThis is an occasion, ain't it?\nI'm feelin' good and they hate it\nShit, I don't recognize these faces, yeah\nWhere you from? Who you came with?\nStarted in the basement\nMade it way above the top, now I'm in a spaceship\nIn a spaceship, shit is spacious\n\n[Verse 1]\nSwear your life is basic\nAll you do is sit around the house, you gettin' faded\nThat ain't entertainment, yeah\nYou missin' every single shot that you ain't takin'\nHey, kid, you could use a little bit of your imagination\nIt could do you right, improve a life you busy wastin'\nSaid it's your money if you make it\nOtherwise, it's just a conversation\nOkay, why you always hatin'?\nLacin' up my sneakers, I be runnin' out of patience, yeah\nIt ain't your money 'til you make it\nOtherwise, it's just a conversation\n\n[Chorus]\nWe ain't on the same shit, no way\nYou ain't from my planet, we don't speak the same language\nThis is an occasion, ain't it?\nI'm feelin' good and they hate it\nShit, I don't recognize these faces, yeah\nWhere you from? Who you came with?\nStarted in the basement\nMade it way above the top, now I'm in a spaceship\nIn a spaceship, shit is spacious\n\n\n[Verse 2]\nEverybody famous, everybody wild, everybody dangerous\nGet a couple dollars, now they act the strangest\nNow they wanna give a couple statements\nWhen you really 'bout it, you don't say shit\nPocket full of aces\nTake over my city, yeah, that's really home invasions\nAll my homies wit' me, gettin' busy, no vacations\nThey ain't on my wave but they wavin'\nStop it, boy, you runnin' through your savings, yeah\nI just feel amazin'\nMy head up in the clouds but my feet be on the pavement, yeah\nIt ain't your money 'til you make it\nOtherwise, it's just a conversation\n\n[Chorus]\nWe ain't on the same shit, no way\nYou ain't from my planet, we don't speak the same language\nThis is an occasion, ain't it?\nI'm feelin' good and they hate it\nShit, I don't recognize these faces, yeah\nWhere you from? Who you came with?\nStarted in the basement\nMade it way above the top, now I'm in a spaceship\nIn a spaceship, shit is spacious", "language": "en"}
{"artist": "Mac Miller", "album": "Swimming", "track_title": "Dunno", "lyrics": "[Intro]\nYeah\nHmm-hmm\nHmm-hmm\nYeah\n\n[Verse 1]\nShe do whatever she like\nAnd that just don't seem right, yeah\nMake people so mad, yeah\nThey want her so bad, hmm\nWell, we was fuckin', almost missed my flight\nI wasn't even trippin', I said, \"It's alright,\" yeah\nGoddamn, we was hit last night\nWouldn't you rather get along?\nWouldn't you rather get along?\nYou was coughin' when you hit my weed\nBut I've never seen you feel that free\nSo cute you wanna be like me\nWouldn't you rather get along?\nWouldn't you rather get along?\n\n[Chorus]\nUntil, until there is no longer\nLet's get lost inside the cloud\nAnd you, you don't gotta work harder\nI can calm you down\n\n\n[Verse 2]\nYeah\nWell, I was busy when you hit my phone\nBut you miss me, told me come back home, yeah\nAnd you don't really like to sleep alone\nBut I'm takin' too long, I'm always takin' too long, yeah\nBaby, we don't need a trip, we could be right here\nWhen the shit get weird, we could switch up gears\nI wanna see them lips, kissin' ear to ear\nI wanna hear your song\nOh, I wanna feel just how you feel\nTouch you one more time so I know you're real\nWe could spin that wheel\nWouldn't you rather get along?\n\n[Chorus]\nUntil, until there is no longer\nLet's get lost inside the cloud\nAnd you, you don't gotta work harder\nI can calm you down\n\n[Outro]\nI think we just might be alright (Ooh), thank God\nI think we're gonna be alright (Ooh), alright, okay\nHmm, hold me close, don't hold your breath\nAnd this feelin' your favorite, I know", "language": "en"}
{"artist": "Mac Miller", "album": "Swimming", "track_title": "Jet Fuel", "lyrics": "[Part I: Jet Fuel]\n[Intro: Cutty Ranks]\nStopper, to every DJ, dem haffi talk to me proper\nMi come a dancehall, mi a go kill you with di lingua\nGalang Cutty Ranks 'cause you full up of a stamina\nAnyweh me go, Lord, a roots and culture\nOne man me praise, a di Almighty, Jah Jah\nJah Jah give me strength and him give me di power\nThat's why Cutty Ranking, full up of stamina\nCome a dancehall, mi a go kill you with di...\n\n[Verse 1]\nYeah, used to wanna be a superhero\nFlyin' round with a cape catchin' bad guys\nNow my head underwater\nBut I ain't in the shower and I ain't gettin' baptized (No)\nTo the good and the bad times (Bad times)\nAll the cuts, broken bones, and the black eyes (Black eyes)\nYoung motherfucker with a mad mind\nMade a couple million off of rap lines\nY'all can't tell me nuttin' no more\nCame from the basement under that floor (Floor)\nYou don't come close, you don't even know I'm the GOAT (Hmm)\nYou don't need to know how it go 'cause I know what you want\nAll I wanna do is the most\nBackflip off the rope, sky hook when I'm in the post\nYeah, my girl too clutch to choke, mm (Hmm)\nAnd I ain't callin' it quits\nYou can build a wall with your bricks\nWhile I keep talkin' that shit, it's like this (This), hmm (It's like this)\nLiquor still in my cup (My cup)\nGet faded when I wake up (Wake up)\n'Cause everything is too much (Too much)\nSo what? (So what?)\n\n\n[Pre-Chorus]\nWoke up this mornin' with a bright idea (Smoke)\nMaybe I can exist forever right here (Let it run)\nYeah (Mm-hmm, yeah)\nHmm-hmm-hmm\nHmm, hmm\n\n[Chorus]\nOkay, okay\nWell, I'ma be here for a while, longer than I did expect to\nI was out of town, gettin' lost 'til I was rescued\nNow I'm in the clouds, come down when I run out of jet fuel\nBut I never run out of jet fuel\nWell, I'ma be here for a while, longer than I did expect to\nI was out of town, gettin' lost 'til I was rescued\nNow I'm in the clouds, come down when I run out of jet fuel\nBut I never run out of jet fuel\n\n[Verse 2]\nHundred-twenty on a car that I don't whip (Woo)\nI don't even pull it up the driveway\nThrowin' up shots like I don't miss (No)\nNever put a limit on the high stakes (No)\nTry to pull my card, tell them, \"Go Fish\" (Woo)\nYou ain't gonna find a lie in my face\nI pick it up and let it go quick\nThey wanna get pussy from my— (Uh-oh)\nYeah, I don't say nuttin' that I don't know\nJumpin' out the womb wearin' Polo\nEverybody wanna jump in, but I'm old school\nLone wolf, take 'em on solo, yeah\nI don't need nobody (I don't need nobody)\nI don't need to be nobody (I don't need to be nobody)\nI'm just doin' my thing\nKick it at the crib, I don't see nobody, no\nSo over there with that bullshit\nWe don't need it on this side\nI'm pullin' up in that new shit\nYou always whippin' that dick ride\nI demand your respect\nI won't share my connect (No)\nLet's get this clear, I am here\nI don't care who got next, young vet (Goddamn)\nFeelin' like they forget, I let it slide, this time\nLike twenty-five years I've been high and no less (Yes)\nShit, I know, I don't guess\nRather glow, I won't stress\nBetter say that shit with your chest\n\n\n[Chorus]\nOkay, okay\nWell, I'ma be here for a while, longer than I did expect to\nI was out of town, gettin' lost 'til I was rescued\nNow I'm in the clouds, come down when I run out of jet fuel (Jet fuel)\nBut I never run out of jet fuel (Jet fuel)\nWell, I'ma be here for a while, longer than I did expect to\nI was out of town, gettin' lost 'til I was rescued\nNow I'm in the clouds, come down when I run out of jet fuel (Jet fuel)\nBut I never run out of jet fuel (Jet fuel)\n\n[Instrumental]\n\n[Part II: Now Is Only Now]\n\n[Outro]\nFate in your hands\nWhile you're waitin' for me\nI'm already there\nFallin' in deep\nNow is only now\nHead back to the ground, dear", "language": "en"}
{"artist": "Mac Miller", "album": "Swimming", "track_title": "2009", "lyrics": "[Intro]\nYeah\nEric\nWell\n\n[Chorus]\nI don't need to lie no more\nNowadays all I do is shine, take a breath and ease my mind, and\nShe don't cry no more\nShe tell me that I get her high 'cause an angel's s'posed to fly, and\nI ain't askin' \"Why?\" no more\nOh, no, I take it if it's mine, I don't stay inside the lines\nIt ain't 2009 no more\nYeah, I know what's behind that door\n\n[Verse 1]\nYeah, okay, you gotta jump in to swim\nWell, the light was dim in this life of sin\nNow every day I wake up and breathe\nI don't have it all but that's alright with me\nTake it nice and easy, took a flight to see me\nSend you back home with a light that's beamin'\nThe whole team 'bout to figure it out\nWe ice cold, that's what winter about\nAnd sometimes, sometimes I wish I took a simpler route\nInstead of havin' demons that's as big as my house, mhm\nHave a ball with a dribble and bounce\n'Cause the party ain't over 'til they're kickin' me out, yeah\nIsn't it funny? We can make a lot of money\nBuy a lot of things just to feel a lot of ugly\nI was yea high and muddy\nLookin' for what was lookin' for me\n\n\n[Chorus]\nBut I don't need to lie no more\nNowadays all I do is shine, take a breath and ease my mind, and\nShe don't cry no more\nShe tell me that I get her high 'cause an angel's s'posed to fly, and\nI ain't askin' \"Why?\" no more\nOh, no, I take it if it's mine, I don't stay inside the lines\nIt ain't 2009 no more\nYeah, I know what's behind that door\n\n[Verse 2]\nYeah, they ask me what I'm smilin' for\nWell, because I've never been this high before\nIt's like I never felt alive before\nMhm, I'd rather have me peace of mind than war\nSee, me and you, we ain't that different\nI struck the fuck out and then I came back swingin'\nTake my time to finish, mind my business\nA life ain't a life 'til you live it, I was diggin' me a hole\nBig enough to bury my soul\nWeight of the world, I gotta carry my own\nMy own, with these arms I can carry you home\nI'm right here when you scared and alone, and I ain't never in a hurry\nYou don't ever gotta worry\nEven when it's 7:30 and the time is runnin' low\nWhen your heart get cold\nSee what's behind all them unturned stones\nAnd I'm a pro when it come to my job\nBut really I'm just tryna start believin' in God\nNow when it gets hard\nI don't panic, I don't sound the alarm\n\n\n[Chorus]\nBecause I don't need to lie no more\nNowadays all I do is shine, take a breath and ease my mind, and\nShe don't cry no more\nShe tell me that I get her high 'cause an angel's s'posed to fly, and\nI ain't askin' \"Why?\" no more\nOh, no, I take it if it's mine, I don't stay inside the lines\nIt ain't 2009 no more\nYeah, I know what's behind that door\nI don't need to lie no more\nNowadays all I do is shine, take a breath and ease my mind, and\nShe don't cry no more\nShe tell me that I get her high 'cause an angel's s'posed to fly, and\nI ain't askin' \"Why?\" no more\nOh, no, I take it if it's mine, I don't stay inside the lines\nIt ain't 2009 no more\nYeah, I know what's behind that door", "language": "en"}
{"artist": "Mac Miller", "album": "Swimming", "track_title": "So It Goes", "lyrics": "[Intro]\n*Dog barking*\nYeah\nYeah, yeah, um\n(What?) Yeah\n('Sup?) Well\n\n[Verse 1]\nYou could have the world in the palm of your hands\nYou still might drop it\nAnd everybody wanna reach inside your pockets\nI tell 'em, \"Red light, stop it\"\nShit, that give me more headaches than alcoholics\nThere was nothin' in my wallet, just a lot of dreamin'\nI built a crib on top o' the Promised Land, we'll call it even, hmm\nI bring more flavor than all the seasons\nWinter, spring, summer, fall\nThe grass is always greener 'til I cut it all\nPlease leave me to my studies, I give you no applause\nMy hands been countin' money, and it's hard to be the boss\nBut somebody gotta do it (It gets so exhausting)\nOften with the bullshit, and, baby, I been through it\nEnough for the both of us\nSo come over later and we won't let no one close to us\nWe could be posted up\nYeah\n\n\n[Bridge]\nOkay, well, you could have the world in the palm of your hands\nYou still might drop it\nAnd everybody wanna reach inside your pockets\nSo it goes\nIt's like, in every conversation, we the topic\nThis narcissism, more like narcotics\nSo it goes\n\n[Chorus]\nWell, everybody gather round\nI'm still standin', sit down\nWoah-oh\nAnd I know I been out (And I know I been out)\nBut now I'm back in town (But now I'm back in town), so I'll\nShow you the ropes\nSo it goes, so it goes, so it goes\nLa-da-da-da, da-da-da\nLa-da-da-da, da-da-da\nSo it goes (Ya, so it goes)\nLa-da-da-da, da-da-da\nLa-da-da-da-da, da-da-da\nSo it goes\n\n[Verse 2]\nWell, this is a special delivery, comin' to you live with the\nEndless artillery, always down to ride\nMy eyes on the enterprise\nNine lives, never die, fuck a Heaven, I'm still gettin' high\nNever mind, did I mention I'm fine?\n'Cause her pussy gettin' wetter when the weather dry\nClementine, peelin' off and everyone get left behind\nI'm only 5'7'' 'cept I'm feelin' like I'm 7'5\"\nDamn it, cross planets, interstellar\nNever land, not a Jackson, packed with action\nSo what's happenin', my man?\nNo relaxin', kickin' back, this ain't exactly in the plan\nI can't get no satisfaction, goddamn\nThey sayin' I been gone too long\nI could just tell 'em, \"Fuck you,\" but that come on too strong\nMy God, it go on and on\nJust like a circle, I go back where I'm from\n\n\n[Chorus]\nWell, everybody gather round\nI'm still standin', sit down\nWoah-oh\nAnd I know I been out (And I know I been out)\nBut now I'm back in town (But now I'm back in town), so I'll\nShow you the ropes\nSo it goes, so it goes, so it goes\nLa-da-da-da, da-da-da\nLa-da-da-da, da-da-da\nSo it goes (Ya, so it goes)\nLa-da-da-da, da-da-da\nLa-da-da-da-da, da-da-da\nSo it goes\n[Instrumental Outro]", "language": "en"}
